//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "StdAfx.h"
#include "Base.h"
//---------------------------------------------------------------------------
Base::Base(void)
{
	// Конструктор класса
Bound = new BoundingSphere();
AlternativeFile = "s0\\Base.x";
}
//---------------------------------------------------------------------------
Base::~Base(void)
{
	// Деструктор класса
delete Bound;
}
//---------------------------------------------------------------------------
//                                  ФУНКЦИИ
//---------------------------------------------------------------------------
bool Base::SetRadius(float NewBig,float NewSmall)
{
	// Установить параметры орбиты
BigRadius = NewBig;
SmallRadius = NewSmall;
if(Mesh!=NULL) {	// Переместить базу в начальную точку
	MoveInto(-BigRadius,0.0,0.0);
	UpdateTransform();
}
return true;
}
//---------------------------------------------------------------------------
bool Base::SetRotateSpeed(float NewRotateSpeed)
{
	// Установить скорость собственного вращения
RotateSpeed = NewRotateSpeed;
return true;
}
//---------------------------------------------------------------------------
bool Base::SetMoveSpeed(float NewMoveSpeed)
{
	// Установить скорость движения по орбите
MoveSpeed = NewMoveSpeed;
return true;
}
//---------------------------------------------------------------------------
bool Base::SetName(std::string NewName)
{
	// Установить название
Name = NewName;
return true;
}
//---------------------------------------------------------------------------
bool Base::SetFile(std::string NewFile)
{
	// Установить путь к файлу с моделью
File = NewFile;
return true;
}
//---------------------------------------------------------------------------