//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "StdAfx.h"
#include "BoundingObject.h"
//---------------------------------------------------------------------------
BoundingObject::BoundingObject(void)
{
	// Конструктор класса
Position = D3DXVECTOR3(0.0f,0.0f,0.0f);
pFrustum = NULL;
}
//---------------------------------------------------------------------------
BoundingObject::~BoundingObject(void)
{
	// Деструктор класса

}
//---------------------------------------------------------------------------
bool BoundingObject::SetFrustum(FrustumPiramide* Frustum)
{
	// Установка указателя на пирамиду видимости. Если pFrustum остался
	// равен NULL - считаем, что пирамида видимости = всей сцене (все объекты
	// нужно отрисовывать)
pFrustum = Frustum;
return true;
}
//---------------------------------------------------------------------------
//        ВИРТУАЛЬНЫЕ ФУНКЦИИ (ПЕРЕОПРЕДЕЛЯЕМЫЕ В КЛАССАХ-НАСЛЕДНИКАХ)
//---------------------------------------------------------------------------