//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "StdAfx.h"
#include "Planet.h"
//---------------------------------------------------------------------------
Planet::Planet(void)
{
	// Конструктор класса
Bound = new BoundingSphere();
AlternativeFile = "s0\\Sun.x";
}
//---------------------------------------------------------------------------
Planet::~Planet(void)
{
	// Деструктор класса
delete Bound;
}
//---------------------------------------------------------------------------
//                                  ФУНКЦИИ
//---------------------------------------------------------------------------
bool Planet::SetPosition(float NewX,float NewY,float NewZ)
{
	// Установить положение звезды
X = NewX;
Y = NewY;
Z = NewZ;
if(Mesh!=NULL) {	// Переместить звезду в начальную точку
	MoveInto(X,Y,Z);
	UpdateTransform();
}
return true;
}
//---------------------------------------------------------------------------
bool Planet::SetRotateSpeed(float NewRotateSpeed)
{
	// Установить скорость вращения звезды
RotateSpeed = NewRotateSpeed;
return true;
}
//---------------------------------------------------------------------------
bool Planet::SetName(std::string NewName)
{
	// Установить название зведы
Name = NewName;
return true;
}
//---------------------------------------------------------------------------
bool Planet::SetFile(std::string NewFile)
{
	// Установить путь к файлу с моделью
File = NewFile;
return true;
}
//---------------------------------------------------------------------------