//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include "StdAfx.h"
#include "Portal.h"
//---------------------------------------------------------------------------
Portal::Portal(void)
{
	// Конструктор класса
Bound = new BoundingSphere();
AlternativeFile = "s0\\Portal.x";
}
//---------------------------------------------------------------------------
Portal::~Portal(void)
{
	// Деструктор класса
delete Bound;
}
//---------------------------------------------------------------------------
//                                  ФУНКЦИИ
//---------------------------------------------------------------------------
bool Portal::SetRadius(float NewBig, float NewSmall)
{
	// Установить параметры орбиты
BigRadius = NewBig;
SmallRadius = NewSmall;
if(Mesh!=NULL) {	// Переместить портал в начальную точку
	MoveInto(-BigRadius,0.0,0.0);
	UpdateTransform();
}
return true;
}
//---------------------------------------------------------------------------
bool Portal::SetMoveSpeed(float NewMoveSpeed)
{
	// Установить скорость движения по орбите
MoveSpeed = NewMoveSpeed;
return true;
}
//---------------------------------------------------------------------------
bool Portal::SetDest(std::string NewDest)
{
	// Установить сектор, в который ведет портал
Dest = NewDest;
return true;
}
//---------------------------------------------------------------------------
bool Portal::SetName(std::string NewName)
{
	// Установить название
Name = NewName;
return true;
}
//---------------------------------------------------------------------------
bool Portal::SetFile(std::string NewFile)
{
	// Установить путь к файлу с моделью
File = NewFile;
return true;
}
//---------------------------------------------------------------------------