//---------------------------------------------------------------------------
#ifndef Object3DContainerH
#define Object3DContainerH
//---------------------------------------------------------------------------
#include "Object3DUnit.h"
#include "BoundingOBB.h"
//---------------------------------------------------------------------------
// Класс Object3DContainer. Объект "Контейнер"
//---------------------------------------------------------------------------
class Object3DContainer : public Object3DUnit
{
protected:      // Доступно здесь и для потомков
        // Переменные


private:        // Доступно только здесь
        // Переменные


public:         // Доступно везде
        Object3DContainer(void);        // Констуктор класса без параметров
        ~Object3DContainer();           // Деструктор класса

        // Переменные

        // Функции

};
//---------------------------------------------------------------------------
#endif
