//---------------------------------------------------------------------------
#pragma hdrstop

#include "Object3DStar.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
Object3DStar::Object3DStar(void)
{
        // Конструктор класса без параметров
        // Инициализация переменных
Bound = new BoundingSphere();
AlternativeFile = "s0\\Sun.x";
}
//---------------------------------------------------------------------------
Object3DStar::~Object3DStar()
{
        // Деструктор класса
delete Bound;
}
//---------------------------------------------------------------------------
//                                  ФУНКЦИИ
//---------------------------------------------------------------------------
bool Object3DStar::SetPosition(float NewX,float NewY,float NewZ)
{
        // Установить положение звезды
X = NewX;
Y = NewY;
Z = NewZ;
if(Mesh!=NULL) {        // Переместить звезду в начальную точку
        MoveInto(X,Y,Z);
        UpdateTransform();
        }
return true;
}
//---------------------------------------------------------------------------
bool Object3DStar::SetRotateSpeed(float NewRotateSpeed)
{
        // Установить скорость вращения звезды
RotateSpeed = NewRotateSpeed;
return true;
}
//---------------------------------------------------------------------------
bool Object3DStar::SetName(AnsiString NewName)
{
        // Установить название зведы
Name = NewName;
return true;
}
//---------------------------------------------------------------------------
bool Object3DStar::SetFile(AnsiString NewFile)
{
        // Установить путь к файлу с моделью
File = NewFile;
return true;
}
//---------------------------------------------------------------------------

