//---------------------------------------------------------------------------
#ifndef Object3DSkyBoxH
#define Object3DSkyBoxH
//---------------------------------------------------------------------------
#include "Object3DUnit.h"
//---------------------------------------------------------------------------
// Класс Object3DSkyBox. Объект "SkyBox"
//---------------------------------------------------------------------------
class Object3DSkyBox : public Object3D
{
protected:      // Доступно здесь и для потомков
        // Переменные


private:        // Доступно только здесь
        // Переменные


public:         // Доступно везде
        Object3DSkyBox(void);   // Констуктор класса без параметров
        ~Object3DSkyBox();      // Деструктор класса

        // Переменные

        // Функции

};
//---------------------------------------------------------------------------
#endif
