//---------------------------------------------------------------------------
#pragma hdrstop

#include "Object3DContainer.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
Object3DContainer::Object3DContainer(void)
{
        // Конструктор класса без параметров
        // Инициализация переменных
Bound = new BoundingOBB();
}
//---------------------------------------------------------------------------
Object3DContainer::~Object3DContainer()
{
        // Деструктор класса
delete Bound;
}
//---------------------------------------------------------------------------
//                                  ФУНКЦИИ
//---------------------------------------------------------------------------

